#include¡¶reg52.h¡·
#include ¡°lcd1602_drv.h¡±
sbit RS_1602=P2^6;
sbit LCD_RW=P2^5; //LCD RW Ö÷³ÌĞò½ÓµØÒ»Ö±µÈÓÚ0
sbit E_1602=P2^7;¡
uchar aa£¬jj;
¡¡¡¡//¢ÙĞ´ÃüÁî×Ó³ÌĞò
void write_1602com£¨uchar com£© //Òº¾§Ğ´ÈëÖ¸Áîº¯Êı
{
¡¡¡¡RS_1602=0; //ÖÃÎªĞ´ÈëÃüÁî
¡¡¡¡P0=com; //ËÍÈëÊı¾İ
¡¡¡¡delay£¨1£©;
¡¡¡¡E_1602=1;
¡¡¡¡delay£¨1£©;
¡¡¡¡E_1602=0;
}
¡¡¡¡//¢ÚĞ´Êı¾İ×Ó³ÌĞò
¡¡¡¡void write_1602dat£¨uchar dat£©
¡¡¡¡{
¡¡¡¡RS_1602=1; //ÖÃÎªĞ´Êı¾İ
¡¡¡¡P0=dat; //ËÍÈëÊı¾İ
¡¡¡¡delay£¨1£©;
¡¡¡¡E_1602=1;
¡¡¡¡delay£¨1£©;
¡¡¡¡E_1602=0;
¡¡¡¡}
¡¡¡¡void lcd_init£¨void£©
¡¡¡¡{
¡¡¡¡write_1602com£¨0x38£©; //16*2 5*7µãÕó 8Î»Êı¾İÏß
¡¡¡¡delay£¨5£©;
¡¡¡¡write_1602com£¨0x38£©;
¡¡¡¡delay£¨5£©;
¡¡¡¡write_1602com£¨0x38£©;
¡¡¡¡delay£¨5£©;
¡¡¡¡write_1602com£¨0x08£©;
¡¡¡¡write_1602com£¨0x0c£©; //¿ªÏÔÊ¾ ²»ÏÔÊ¾¹â±ê ²»ÉÁË¸
¡¡¡¡write_1602com£¨0x06£©; //ÏÔÊ¾²»ÒÆ¶¯ ¹â±êÓÒÒÆ
¡¡¡¡write_1602com£¨0x01£©; // ÇåÆÁ
¡¡¡¡}